[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / s3 bucket-stage2 ](https://app.env0.com/p/77557d01-e8f5-4ed2-b44d-82c73bfa3937/environments/46017173-a47e-4472-a649-db919bb18767):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.object must be replaced
-/+ resource "aws_s3_object" "object" {
!       bucket_key_enabled     = false -> (known after apply)
!       etag                   = "d81b8ee322166aa55569d5279fca5267" -> (known after apply)
!       id                     = "index.html" -> (known after apply)
!       key                    = "index.html" -> "index-stage2.html" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "../index.html" -> "../index-stage2.html"
!       storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
+       version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│ 
│   on s3.tf line 2, in provider "aws":
│    2:   version = "~> 4.0"
│ 
│ Terraform 0.13 and earlier allowed provider version constraints inside the
│ provider configuration block, but that is now deprecated and will be
│ removed in a future version of Terraform. To silence this warning, move the
│ provider version constraint into the required_providers block.
╵
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/77557d01-e8f5-4ed2-b44d-82c73bfa3937/environments/46017173-a47e-4472-a649-db919bb18767/deployments/6111a976-3ea5-4f46-bf98-552887c9a833)